# Data Representation

## Imports

In [7]:
import pandas as pd

## Data Loading

In [ ]:
## had to make it raw for make it work
url1 = "https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/refs/heads/master/Chapter01/Data/USA_Housing.csv"

In [ ]:
url2 = "https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/refs/heads/master/Chapter01/Data/Banking_Marketing.csv"

In [ ]:
df1 = pd.read_csv(url1)

In [ ]:
df2 = pd.read_csv(url2)

In [ ]:
df2.shape

In [ ]:
df1.shape

In [ ]:
## frist three
df1.head(3)

In [ ]:
## last three
df1.tail(3)

In [ ]:
## refers to a function
df1.info()

In [ ]:
df1['Address']

In [ ]:
df1['Address'].head(10)

In [ ]:
df1.columns

In [ ]:
df2.isna().sum()

In [ ]:
##all numeric coloumns only
df1.describe()

In [ ]:
# Retrieve the first four rows and first three columns using iloc
df1.iloc[0:4, 0:3]

In [ ]:
# Retrieve data using column labels with loc
df1.loc[0:4, ["Avg. Area Income", "Avg. Area House Age"]]

In [ ]:
X = df1.drop('Price', axis=1)

In [ ]:
## test
X.head()

In [ ]:
X.shape

In [ ]:
y = df1['Price']

In [ ]:
y.head(10)

In [ ]:
y.shape

# Data Cleaning

# Data integration

In [2]:
dataset1 = "https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/student.csv"
dataset2 = "https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/mark.csv"

In [9]:
df1 = pd.read_csv(dataset1)
df2 = pd.read_csv(dataset2)

In [11]:
# Step 4: Display the first 5 rows of df1 (student data)
print("Student Dataset (df1):")
display(df1.head())

Student Dataset (df1):

   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no

In [13]:
# Step 5: Display the first 5 rows of df2 (marks data)
print("Marks Dataset (df2):")
display(df2.head())

Marks Dataset (df2):

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi

In [15]:
# Step 6: Merge both DataFrames on the 'Student_id' column
df = pd.merge(df1, df2, on='Student_id')

In [17]:
print("Merged Dataset (df):")
display(df.head(10))

Merged Dataset (df):

   Student_id  Age  Gender      Grade Employed  Mark     City
0           1   19    Male  1st Class      yes    95  Chennai
1           2   20  Female  2nd Class       no    70    Delhi
2           3   18    Male  1st Class       no    98   Mumbai
3           4   21  Female  2nd Class       no    75     Pune
4           5   19    Male  1st Class       no    89    Kochi
5           6   20    Male  2nd Class      yes    69  Gwalior
6           7   19  Female  3rd Class      yes    52   Bhopal
7           8   21    Male  3rd Class      yes    54  Chennai
8           9   22  Female  3rd Class      yes    55    Delhi
9          10   21    Male  1st Class       no    94   Mumbai